# ViewGraphSchedUnitsFormat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewGraphSchedUnitsFormat Property
ParameterTypeId Class See Also
---
"Off-Grid Units Format"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewGraphSchedUnitsFormat { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewGraphSchedUnitsFormat As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewGraphSchedUnitsFormat {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace